examples/buoyantCavity/0/KappaEff
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      KappaEff;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 2.15035e-05;

boundaryField
{
    topAndBottom
    {
        type            calculated;
        value           uniform 2.15035e-05;
    }
    frontAndBack
    {
        type            calculated;
        value           uniform 2.15035e-05;
    }
    hot
    {
        type            calculated;
        value           uniform 2.15035e-05;
    }
    cold
    {
        type            calculated;
        value           uniform 2.15035e-05;
    }
}


// ************************************************************************* //
