examples/buoyantCavity/0/wallHeatFlux
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      wallHeatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    topAndBottom
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            calculated;
        value           uniform 0;
    }
    hot
    {
        type            calculated;
        value           nonuniform List<scalar> 
2250
(
353.28
353.28
353.28
353.28
353.28
353.28
353.28
353.28
...
)
;
    }
    cold
    {
        type            calculated;
        value           nonuniform List<scalar> 
2250
(
-116.163
-116.163
-116.163
-116.163
-116.163
-116.163
-116.163
-116.163
...
)
;
    }
}


// ************************************************************************* //
