examples/buoyantCavity/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    topAndBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1050;
        startFace       228225;
    }
    frontAndBack
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          10500;
        startFace       229275;
    }
    hot
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2250;
        startFace       239775;
    }
    cold
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2250;
        startFace       242025;
    }
)

// ************************************************************************* //
