examples/buoyantCavity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

nu 			nu [0 2 -1 0 0 0 0] 1.516e-5;
Pr              	Pr [0 0 0 0 0 0 0] 0.705;
Prt             	Prt [0 0 0 0 0 0 0] 0.85;
Cp0             	Cp0 [0 2 -2 -1 0 0 0] 1004.4;
rho0            	rho0 [1 -3 0 0 0 0 0] 1.204;


// ************************************************************************* //
